brew "bash"
brew "cmake"
brew "coreutils"
brew "curl"
brew "editorconfig"
brew "fd"
brew "fnm"
brew "fzf"
brew "git", args: ["overwrite"]
brew "pcre"
brew "python@3.11", args: ["overwrite"]
brew "rbenv"
brew "ripgrep"
brew "sd"
brew "selene"
brew "shellcheck"
brew "stylua"
brew "taplo"
brew "tmux"
brew "zoxide"

tap "homebrew/cask-fonts" if OS.mac?
cask "font-sauce-code-pro-nerd-font" if OS.mac?
