brew "bash"
brew "bat"
brew "cmake"
brew "coreutils"
brew "curl"
brew "editorconfig"
brew "fd"
brew "fnm"
brew "fzf"
brew "git", args: ["overwrite"]
brew "mr"
brew "ripgrep"
brew "sd"
brew "selene"
brew "shellcheck"
brew "stylua"
brew "taplo"
brew "tmux"
brew "uv"
brew "zoxide"

if OS.mac?
  cask "font-sauce-code-pro-nerd-font"
end
